src/main/java/ru/vk/itmo/test/bazhenovkirill/data/get/latency-2000,180.txt
Running 3m test @ http://localhost:8080
  1 threads and 1 connections
  Thread calibration: mean lat.: 1.075ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.11ms  654.05us  26.72ms   76.36%
    Req/Sec     2.11k   211.56     5.44k    71.85%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.08ms
 75.000%    1.45ms
 90.000%    1.79ms
 99.000%    2.08ms
 99.900%    8.28ms
 99.990%   16.09ms
 99.999%   25.73ms
100.000%   26.74ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.069     0.000000            1         1.00
       0.406     0.100000        34128         1.11
       0.611     0.200000        68157         1.25
       0.806     0.300000       102156         1.43
       0.968     0.400000       136000         1.67
       1.084     0.500000       170283         2.00
       1.138     0.550000       187062         2.22
       1.194     0.600000       204081         2.50
       1.253     0.650000       221164         2.86
       1.339     0.700000       238022         3.33
       1.447     0.750000       255045         4.00
       1.502     0.775000       263557         4.44
       1.560     0.800000       272123         5.00
       1.620     0.825000       280541         5.71
       1.681     0.850000       289058         6.67
       1.737     0.875000       297563         8.00
       1.765     0.887500       301851         8.89
       1.793     0.900000       306008        10.00
       1.823     0.912500       310251        11.43
       1.856     0.925000       314552        13.33
       1.891     0.937500       318815        16.00
       1.909     0.943750       320973        17.78
       1.927     0.950000       323031        20.00
       1.947     0.956250       325209        22.86
       1.966     0.962500       327272        26.67
       1.987     0.968750       329430        32.00
       1.998     0.971875       330524        35.56
       2.008     0.975000       331519        40.00
       2.019     0.978125       332576        45.71
       2.031     0.981250       333626        53.33
       2.046     0.984375       334749        64.00
       2.055     0.985938       335316        71.11
       2.063     0.987500       335789        80.00
       2.075     0.989062       336338        91.43
       2.091     0.990625       336866       106.67
       2.113     0.992188       337367       128.00
       2.133     0.992969       337604       142.22
       2.179     0.993750       337872       160.00
       2.501     0.994531       338131       182.86
       3.065     0.995313       338397       213.33
       3.699     0.996094       338662       256.00
       4.071     0.996484       338797       284.44
       4.543     0.996875       338929       320.00
       5.003     0.997266       339061       365.71
       5.547     0.997656       339194       426.67
       6.131     0.998047       339327       512.00
       6.459     0.998242       339393       568.89
       6.803     0.998437       339459       640.00
       7.227     0.998633       339526       731.43
       7.755     0.998828       339592       853.33
       8.391     0.999023       339658      1024.00
       8.663     0.999121       339692      1137.78
       8.983     0.999219       339726      1280.00
       9.335     0.999316       339758      1462.86
       9.695     0.999414       339792      1706.67
      10.111     0.999512       339824      2048.00
      10.335     0.999561       339842      2275.56
      10.647     0.999609       339858      2560.00
      10.999     0.999658       339874      2925.71
      11.711     0.999707       339891      3413.33
      12.359     0.999756       339907      4096.00
      12.767     0.999780       339916      4551.11
      13.199     0.999805       339924      5120.00
      13.839     0.999829       339932      5851.43
      14.719     0.999854       339941      6826.67
      15.519     0.999878       339949      8192.00
      15.759     0.999890       339953      9102.22
      16.183     0.999902       339957     10240.00
      16.799     0.999915       339961     11702.86
      18.431     0.999927       339966     13653.33
      19.823     0.999939       339970     16384.00
      20.543     0.999945       339972     18204.44
      21.231     0.999951       339974     20480.00
      21.935     0.999957       339976     23405.71
      22.639     0.999963       339978     27306.67
      23.327     0.999969       339980     32768.00
      23.679     0.999973       339981     36408.89
      24.031     0.999976       339982     40960.00
      24.383     0.999979       339983     46811.43
      24.735     0.999982       339984     54613.33
      25.087     0.999985       339985     65536.00
      25.391     0.999986       339986     72817.78
      25.391     0.999988       339986     81920.00
      25.727     0.999989       339987     93622.86
      25.727     0.999991       339987    109226.67
      26.079     0.999992       339988    131072.00
      26.079     0.999993       339988    145635.56
      26.079     0.999994       339988    163840.00
      26.431     0.999995       339989    187245.71
      26.431     0.999995       339989    218453.33
      26.431     0.999996       339989    262144.00
      26.431     0.999997       339989    291271.11
      26.431     0.999997       339989    327680.00
      26.735     0.999997       339990    374491.43
      26.735     1.000000       339990          inf
#[Mean    =        1.110, StdDeviation   =        0.654]
#[Max     =       26.720, Total count    =       339990]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  359997 requests in 3.00m, 23.00MB read
Requests/sec:   1999.99
Transfer/sec:    130.86KB